
cleanText <- function(text) {
  return(gsub("ÃƒÂµ|ÃƒÆ’Ã‚Âµ", "õ", 
              gsub("ÃƒÂ©|ÃƒÆ’Ã‚Â©", "é", 
                   gsub("ÃƒÂº", "ú",
                        gsub("ÃƒÂ£|ÃƒÆ’Ã‚Â¢", "ã", 
                             gsub("(ÃƒÂ§ã)|(Ã§Ã£)|(Ã§Ã£)|(ÃƒÂ§ÃƒÂ£)", "çã",
                                  gsub("ÃƒÂ§õ", "çõ", 
                                       gsub("ÃƒÆ’Ã‚Â¡", "á", text)
                                  )
                             )
                        )
                   )
              )
         )
  )
}